Repository: mishin/perldoc-ru
Catalog: pod2-ru/omegat/project_save.tmx
Source language: en_us
Languages: ru_ru

source: A consequence of this is that B<-MI<MODULE>=number> never does a version check, unless C<I<MODULE>::import()> itself is set up to do a version check, which could happen for example if I<MODULE> inherits from L<Exporter>.
ru_ru: Следствием этого является то, что B<-MI<MODULE>=number> никогда не делает проверку версии, если C<I<MODULE>::import()> сам настроен сделать проверку версий, что может произойти, например, если I<MODULE наследует от L<Exporter> .

source: A few of these are good, some are OK, but many aren't worth your money.
ru_ru: Некоторые из них хорошие, некоторые в порядке, но многие из них не стоят ваших денег.

source: A fine-grained warning facility is also available if you want to manipulate entire classes of warnings; see L<warnings> or L<perllexwarn>.
ru_ru: Мелкозернистой средство предупреждения также доступна, если вы хотите управлять целыми классами предупреждения, см. L<warnings> или L<perllexwarn> .

source: A hash represents a set of key/value pairs:
ru_ru: Хэш представляет собой набор пар ключ/значение:

source: A layer that implements "reading" of files by using I<mmap>(2) to make an entire file appear in the process's address space, and then using that as PerlIO's "buffer".
ru_ru: Слой, который реализует «чтения» файлов с помощью I<mmap> (2), чтобы сделать весь файл отображается в адресное пространство процесса, а затем он используется в качестве «буфера» PerlIO.

source: A layer which does CRLF to C<"\n"> translation distinguishing "text" and "binary" files in the manner of MS-DOS and similar operating systems.
ru_ru: Слой, который делает СRLF для C<"\n"> перевод различия "текст" и "двоичный" файлы в виде MS-DOS и аналогичные операционных систем.

source: A leading colon removes the "name=" part of the response, this allows you to map to the name you need.
ru_ru: Ведущее двоеточие удаляет "name =" часть ответа, это позволяет отображать в имени. (A leading colon removes the "name=" part of the response, this allows you to map to the name you need.)

source: A list of them is given at the start of L<perlfunc> and you can easily read about any given function by using C<perldoc -f I<functionname>>.
ru_ru: Их список приведен в начале L<perlfunc> и вы можете легко прочитать о любой функции с помощью C<perldoc -f I<имя функции>>.

source: A list of directories in which to look for Perl library files before looking in the standard library and the current directory.
ru_ru: Список каталогов, в которых следует искать файлы Perl библиотеки, прежде чем искать в стандартной библиотеке и текущем каталоге.

source: A little builtin syntactic sugar means you can also say B<-mI<MODULE>=foo,bar> or B<-MI<MODULE>=foo,bar> as a shortcut for B<'-MI<MODULE> qw(foo bar)'>.
ru_ru: Немного встроенного синтаксического сахара означает, что вы можете также сказать, B<-mI<MODULE>=foo,bar> или B<-MI<MODULE>=foo,bar> в качестве ярлыка для B<'-MI<MODULE> qw(foo bar)'>.

source: A pragma is a module which influences some aspect of the compile time or run time behaviour of Perl, such as C<strict> or C<warnings>.
ru_ru: Прагма - это модуль, который влияет на некоторые моменты во время компиляции и во время выполнения Perl-кода. Пример прагмы: C<strict>или C<warnings>.

source: A pseudolayer that enables a flag in the layer below to tell Perl that output should be in utf8 and that input should be regarded as already in valid utf8 form.
ru_ru: Псевдослой (Pseudolayer), который включает флаг в слое ниже, чтобы сказать, что Perl вывод должен быть в utf8 и что материалы следует считать уже в utf8 действительны форме.

source: A pseudolayer that manipulates other layers.
ru_ru: Псевдослой (Pseudolayer) который манипулирует другими слоями.

source: A pseudolayer that turns the C<:utf8> flag I<off> for the layer below; unlikely to be useful on its own in the global PERLIO environment variable.
ru_ru: Псевдолой, который превращает флаг C<:utf8> I<off> (I<выключено>) для слоя ниже; вряд ли будет полезна сама по себе в глобальной переменной окружения PERLIO.

source: A reference is a scalar value and can refer to any other Perl data type.
ru_ru: Ссылка является скалярной величиной и может ссылаться на любой другой тип данных Perl.

source: A scalar represents a single value:
ru_ru: Скаляр представляет одно значение:

source: A similar trick involves the I<env> program, if you have it.
ru_ru: Аналогичный трюк предполагает использование программы I<env> , если она у вас есть.

source: A space (or colon) separated list of PerlIO layers.
ru_ru: Пробелы (или доеточия) разделенный список PerlIO слоев.

source: A translation-concealed rooted logical name that contains Perl and the logical device for the @INC path on VMS only.
ru_ru: Перевод скрытой коренится логическое имя, которое содержит Perl и логическое устройство для пути @INC только на VMS.

source: A2p catches the most common case, but doesn't analyze embedded blocks for subtler cases.
ru_ru: А2р ловит самый распространенный случай, но не анализирует встроенные блоки для тонких случаях.

source: A2p cannot do as good a job translating as a human would, but it usually does pretty well.
ru_ru: A2p не может делать работу по переводу так же хорошо, как человек, но он обычно делает свою работу довольно хорошо.

source: A2p does not try to do a complete job of awk emulation at this point.
ru_ru: A2p не пытается сделать полную работу по эмуляции AWK в этой точке.

source: A2p uses no environment variables.
ru_ru: А2р не использует переменные окружения.

source: ARGV[0] translates to $ARGV0, but ARGV[n] translates to $ARGV[$n-1].
ru_ru: ARGV[0] переводит к $ARGV0, но ARGV[N] переводит к $ARGV [$n-1].

source: Actually, it I<will> execute and C<BEGIN>, C<UNITCHECK>, or C<CHECK> blocks and any C<use> statements: these are considered as occurring outside the execution of your program.
ru_ru: На самом деле, эта опция I<будет> выполнять и C<BEGIN>, C<UNITCHECK> или С<CHECK> блоки и любые C<use> объявления: они рассматриваются как происходящие за пределами выполнения вашей программы.

source: Additionally, extra colons can be used to control formatting.
ru_ru: Кроме того, дополнительное двоеточие может быть использовано для управления форматированием.

source: After Perl locates the program, it parses the lines and ignores them because the variable $running_under_some_shell is never true.
ru_ru: После Perl находит программу, он анализирует линии и игнорирует их, потому что переменная $running_under_some_shell никогда не верно.

source: After all, in your journey as a programmer, you are likely to encounter different styles.
ru_ru: В конце концов, в вашем путешествии, как программиста, вы, вероятно, столкнётесь с различными стилями.

source: After locating your program, Perl compiles the entire program to an internal form.
ru_ru: После размещения вашей программы, Perl компилирует внешнюю (по отношению к Perl) программу во внутреннюю форму.

source: After this module-identifying prefix, the rest of the key is entirely up to the module: it may include any characters whatsoever.
ru_ru: После этого модуль идентифицирующей префикс, остальная часть ключа полностью зависит от модуля: он может включать любые символы.

source: Again, like B<-M>, use -B<-d:-I<MOD>> to call C<Devel::I<MOD>::unimport> instead of import.
ru_ru: Опять же, как B<-M>, используйте -B<-d:-I<MOD>> для вызова C<Devel::I<MOD>::unimport> вместо импорта.

source: All available translation packages are to be found under the C<POD2::> namespace.
ru_ru: Все существующие переводы доступны в пространстве имен C<POD2::*>.

source: All references to line numbers by the program (warnings, errors, ...) will treat the C<#!> line as the first line.
ru_ru: Все ссылки на номер строки в программе (предупреждения, ошибки, ...) будут относиться к C<#!> как к первой строке.

source: All such guesses are marked with the comment "C<#???>".
ru_ru: Все эти домыслы, помечены комментарием "C<#???>".

source: All these flags require B<-DDEBUGGING> when you compile the Perl executable (but see C<:opd> in L<Devel::Peek> or L<re/'debug' mode> which may change this).
ru_ru: Все эти флаги требуют B<-DDEBUGGING> при компиляции исполняемого Perl (но см. C<:opd> в L<Devel::Peek> или L<re/'debug' mode> которые могут изменить это).

source: Also note that C<< <> >> passes command line arguments to L<perlfunc/open>, which doesn't necessarily interpret them as file names.
ru_ru: Также отметим, что C<< <> >> передает аргументы командной строки для L<perlfunc/open> , которая не обязательно будет интерпретировать их как имена файлов.

source: Also, when using this option on a script with warnings enabled you may get a lot of spurious "used only once" warnings.
ru_ru: Кроме того, при использовании этой опции на сценарии с включенными предупреждениями вы можете получить много ложных "используется только один раз" ("used only once") предупреждений.

source: Alternatively, put this as the first line of your script:
ru_ru: Кроме того, вставьте это в первую строку вашего скрипта:

source: An alternate delimiter may be specified using B<-F>.
ru_ru: Альтернативные разделители могут быть заданы с помощью B<-F>.

source: An array represents a list of values:
ru_ru: Массив представляет собой список значений:

source: An error occurring during printing is treated as fatal.
ru_ru: Ошибка, произошедшая во время печати рассматриваются как фатальная.

source: An example output might be:
ru_ru: Результат может быть таким:

source: An experimental pseudolayer that removes the topmost layer.
ru_ru: Экспериментальные псевдослой (pseudolayer), который удаляет верхний слой.

source: An implicit split command to the @F array is done as the first thing inside the implicit while loop produced by the B<-n> or B<-p>.
ru_ru: Неявная команда разбиения в массив @F делается, как первая вещь внутри неявного цикла, который создается, если указаны опции B<-n> или B<-p>.

source: An unset or empty PERLIO is equivalent to the default set of layers for your platform; for example, C<:unix:perlio> on Unix-like systems and C<:unix:crlf> on Windows and other DOS-like systems.
ru_ru: Установлен или пустые PERLIO эквивалентна по умолчанию набор слоев для вашей платформы, например, C<:unix:perlio> на Unix-подобных системах и C<:unix:crlf> на Windows и других DOS-подобных систем.

source: And B<-Dr> displays compiled regular expressions; the format of the output is explained in L<perldebguts>.
ru_ru: И B<-Dr> отображает скомпилированные регулярные выражения; формат вывода объясняется в L<perldebguts> .

source: And a partial B<-I> switch could also cause odd results.
ru_ru: И частичный ключ B<-I> мог также вызвать странные результаты.

source: Any architecture-specific and version-specific directories, such as F<version/archname/>, F<version/>, or F<archname/> under the specified locations are automatically included if they exist, with this lookup done at interpreter startup time.
ru_ru: Любой конкретной архитектуры и конкретных версий каталогов, таких как F<version/archname/>, F<version/> или F<archname/> по указанной директории, они автоматически включаются, если они существуют, интерпретатор ищет там во время запуска.

source: Any delimiter can be used to separate the field names.
ru_ru: Любой разделитель может быть использован для отделения имен полей.

source: Any meaningful switches on that line will be applied.
ru_ru: Любое значимое переключателей на этой строке будет применяться.

source: Any switch found there is removed from @ARGV and sets the corresponding variable in the Perl program.
ru_ru: Любая обнаруженная опция удаляется из @ARGV и устанавливает соответствующую переменную в Perl программе.

source: Any switches in the C<PERLDOC> environment variable will be used before the command line arguments.
ru_ru: Все параметры из переменной окружения C<PERLDOC> будут использованы перед аргументами командной строки.

source: Any value 0400 or above will cause Perl to slurp files whole, but by convention the value 0777 is the one normally used for this purpose.
ru_ru: Любое значение 0400 или выше, будет вызывать Perl захватывать файлы целиком, но по соглашению значение 0777 является тем, которое обычно используется для этой цели.

source: Applying the C<:raw> layer is equivalent to calling C<binmode($fh)>.
ru_ru: Применив C<:raw> слой эквивалентен вызову C<binmode($fh)>.

source: Arrays are zero-indexed.
ru_ru: Массивы индексируются с нуля.

source: As a beginning Perl programmer, your most common use of OO Perl will be in using third-party modules, which are documented below.
ru_ru: Как начинающий программист Perl, ваш самый распространенный способ использования OO Perl будет при помощи сторонних модулей, которые описаны ниже.

source: As an alternative, specify a number instead of list of letters (e.g., B<-D14> is equivalent to B<-Dtls>):
ru_ru: В качестве альтернативы указажите число вместо списка букв (например, B<-D14> эквивалентен B<-Dtls>)

source: As it happens, using C<@array> where Perl expects to find a scalar value ("in scalar context") will give you the number of elements in the array:
ru_ru: Как это происходит, используя C<@array>, где Perl ожидает найти скалярное значение ("в скалярном контексте") даст вам количество элементов в массиве:

source: As of 5.8.1, the B<-C> can be followed either by a number or a list of option letters.
ru_ru: По состоянию на 5.8.1, B<-C> может следовать либо номер или список параметров, букв.

source: As of Perl 5.10, it even has a case/switch statement (spelled C<given>/C<when>).
ru_ru: По состоянию на Perl 5.10, у него даже есть оператор case/switch (пишется C<given>/C<when>).

source: As pragmata are implemented as modules, like any other module, C<use myint;> becomes
ru_ru: Прагма реализована как модуль, поэтому C<use myint;> означает:

source: As shown above, Perl creates the backup file whether or not any output is actually changed.
ru_ru: Как было показано выше, Perl создает файл резервной копии в независимости было ли что-либо изменено.

source: As such it will call whatever layer is below it for its operations, typically C<:unix>.
ru_ru: Как таковой, он будет вызывать все, что слой под ним для осуществления своей деятельности, обычно C<:unix>.

source: As well as grouping, parentheses serve a second purpose.
ru_ru: Так же, как группировка, скобки служат второй цели.

source: As with all standard commands, a single-character switch may be clustered with the following switch, if any.
ru_ru: Как и во всех стандартных командах, односимвольный переключатель может быть положен в кластер со следующимо переключателем, если таковые имеются.

source: As with the B<-M> flag, options may be passed to the C<Devel::I<MOD>> package where they will be received and interpreted by the C<Devel::I<MOD>::import> routine.
ru_ru: Как и в случае B<-M> флага, параметры могут быть переданы пакету C<Devel::I<MOD>>, в котором они будут получены и интерпретированы с помощью процедуры C<Devel::I<MOD>::import>.

source: Available in Perls 5.8.1 and later.
ru_ru: Доступный в Perl 5.8.1 и выше.

source: Awk has one operator for both that decides at run time which comparison to do.
ru_ru: Awk имеет один оператор для обеих операций, который решает что делать во время выполнения.

source: Awk arrays are usually translated to hashes, but if you happen to know that the index is always going to be numeric you could change the {...} to [...].
ru_ru: Awk массивы, как правило, переводятся в хэши, но если вы ожидаете, что индекс всегда собирается быть числовыми вы могли бы изменить {...}, в [...].

source: Awk scripts are often embedded in a shell script that pipes stuff into and out of awk.
ru_ru: Awk скрипты часто встроены в шелл скрипты, которые участвую в конвейере (pipe) на входе и выходе из AWK.

source: Awk scripts that do contortions within the END block to bypass the block under such circumstances can be simplified by removing the conditional in the END block and just exiting directly from the perl script.
ru_ru: Awk сценарии, которые делают искажения до END блока в обход блока при таких обстоятельствах может быть упрощена путем удаления условия в блоке END и просто выходом непосредственно из perl скрипта.

source: Awk starts by assuming OFMT has the value %.6g.
ru_ru: Awk начинает, предполагая OFMT имеет значение %.6g.

source: B<-C> on its own (not followed by any number or option list), or the empty string C<""> for the C<PERL_UNICODE> environment variable, has the same effect as B<-CSDL>.
ru_ru: B<-C> сама по себе (не следует любое число или список опций), или пустая строка C<""> для C<PERL_UNICODE> переменной окружения, имеет тот же эффект, как B<-CSDL>.

source: B<-M>I<module> executes C<use> I<module> C<;> before executing your program.
ru_ru: B<-M>I<module> выполняет C<use> I<module> C<;> перед выполнением программы.

source: B<-m>I<module> executes C<use> I<module> C<();> before executing your program.
ru_ru: B<-m>I<module> выполняет C<use> I<module> C<();> перед выполнением программы.

source: B<CMD.EXE> in Windows NT slipped a lot of standard Unix functionality in when nobody was looking, but just try to find documentation for its quoting rules.
ru_ru: B<CMD.EXE> в Windows NT поскользнулся на многой стандартной функциональности Unix, когда никто не смотрел, но попробуйте найти документацию на ее правила экранирования.

source: B<D>escribes search for the item in B<d>etail.
ru_ru: B<О>писывает поиск элемента B<п>одробнее.

source: B<Do not disclose the hash seed> to people who don't need to know it.
ru_ru: B <Не разглашайте хэш семян> для людей, которые не нужно это знать.

source: B<NOTE:> Use of this option is considered insecure, and is intended only for debugging non-deterministic behavior in Perl's hash function.
ru_ru: B <ПРИМЕЧАНИЕ:> Использование этой опции считается небезопасной, и предназначен только для отладки недетерминированное поведения в хэш-функции Perl.

source: B<Note: This is not a substitute for C<-T>!> This is meant to be used I<only> as a temporary development aid while securing legacy code: for real production code and for new secure code written from scratch, always use the real B<-T>.
ru_ru: B<Замечание: Это не заменяет C<-T>!> Это должно быть использовано I<только> в качестве временной помощи в целях развития при обеспечении унаследованного кода: для реального кода производства и новый безопасный код, написанный с нуля, всегда использует реальный B<-T>.

source: B<Note:> Since perl 5.10.1, if the B<-C> option is used on the C<#!> line, it must be specified on the command line as well, since the standard streams are already set up at this point in the execution of the perl interpreter.
ru_ru: B <Note:> Начинаяс perl 5.10.1, если опция B<-C> используется на строке C<#!>, то он должен быть указан в командной строке, а, так как стандартные потоки уже настроены в этот момент исполнения интерпретатора Perl.

source: B<Note> that any information about the hash function, especially the hash seed is B<sensitive information>: by knowing it, one can craft a denial-of-service attack against Perl code, even remotely; see L<perlsec/"Algorithmic Complexity Attacks"> for more information.
ru_ru: B <Примечание> , что любая информация о хэш-функции, особенно хэш семя B<sensitive information> :, Зная это, можно выработать отказ в обслуживании против кода Perl, даже отдаленно, см. L<perlsec/\"Algorithmic Complexity Attacks\"> для получения дополнительной информации.

source: B<PLEASE NOTE: The hash seed is sensitive information>.
ru_ru: B <ПОЖАЛУЙСТА, ОБРАТИТЕ ВНИМАНИЕ: хэш ключи чувствительно к информации> .

source: B<WARNING: It does not check for validity and as such should be handled with extreme caution for input, because security violations can occur with non-shortest UTF-8 encodings, etc.> Generally C<:encoding(utf8)> is the best option when reading UTF-8 encoded data.
ru_ru: B <WARNING: Он не проверяет на достоверность и как таковой должны быть обработаны с особой осторожностью для ввода, так как нарушения безопасности могут происходиять с не-кратчайший UTF-8 кодировках, и т.д..> Вообще C<:encoding(utf8)> является наилучшим вариантом при чтении UTF-8 закодированных данных.

source: B<a2p> [I<options>] [I<filename>]
ru_ru: B<a2p> [I<опции>] [I<имя файла>]

source: B<perl> S<[ B<-sTtuUWX> ]> S<[ B<-hv> ] [ B<-V>[:I<configvar>] ]> S<[ B<-cw> ] [ B<-d>[B<t>][:I<debugger>] ] [ B<-D>[I<number/list>] ]> S<[ B<-pna> ] [ B<-F>I<pattern> ] [ B<-l>[I<octal>] ] [ B<-0>[I<octal/hexadecimal>] ]> S<[ B<-I>I<dir> ] [ B<-m>[B<->]I<module> ] [ B<-M>[B<->]I<'module...'> ] [ B<-f> ]> S<[ B<-C [I<number/list>] >]> S<[ B<-S> ]> S<[ B<-x>[I<dir>] ]> S<[ B<-i>[I<extension>] ]> S<[ [B<-e>|B<-E>] I<'command'> ] [ B<--> ] [ I<programfile> ] [ I<argument> ]...>
ru_ru: B<perl> S<[ B<-sTtuUWX> ]> S<[ B<-hv> ] [ B<-V>[:I<configvar>] ]> S<[ B<-cw> ] [ B<-d>[B<t>][:I<отладчик>] ] [ B<-D>[I<кол-во/список>] ]> S<[ B<-pna> ] [ B<-F>I<шаблон> ] [ B<-l>[I<восьмеричный>] ] [ B<-0>[I<восьмеричный/шестнадцатеричный>] ]> S<[ B<-I>I<dir> ] [ B<-m>[B<->]I<модуль> ] [ B<-M>[B<->]I<'модуль...'> ] [ B<-f> ]> S<[ B<-C [I<кол-во/список>] >]> S<[ B<-S> ]> S<[ B<-x>[I<dir>] ]> S<[ B<-i>[I<расширение>] ]> S<[ [B<-e>|B<-E>] I<'команда'> ] [ B<--> ] [ I<файл программы> ] [ I<аргумент> ]...>

source: B<perldoc> looks up a piece of documentation in .pod format that is embedded in the perl installation tree or in a perl script, and displays it via C<groff -man | $PAGER>.
ru_ru: I<perldoc> позволяет получить часть документации в .pod формате, которая встроена в дистрибутив perl или Perl-скрипты и доступна с помощью C<pod2man | nroff -man | $PAGER>.

source: Be sure to change all operations the variable is involved in to match.
ru_ru: Будьте тогда намерены изменить все операционные переменные, которые участвуют в поиске.

source: Because B<perldoc> does not run properly tainted, and is known to have security issues, when run as the superuser it will attempt to drop privileges by setting the effective and real IDs to nobody's or nouser's account, or -2 if unavailable.
ru_ru: Т. к. B<perldoc> не запускается в tainted-режиме, существуют проблемы с безопасностью. Когда программа запускается из-под суперпользователя, она пытается удалить привилегии и сменить настоящий ID на неопределенный или на неопределенный аккаунт, если не получилось, то на -2.

source: Because historically some operating systems silently chopped off kernel interpretation of the C<#!> line after 32 characters, some switches may be passed in on the command line, and some may not; you could even get a "-" without its letter, if you're not careful.
ru_ru: Потому что исторически некоторые операционные системы молча отрубили в ядре интерпретацию C<#!> строки после 32 символов, некоторые переключатели могут быть переданы в командной строке, а некоторые не могут, вы могли бы даже получить "-" без этого письма, если вы не будете осторожны.

source: Because we don't have special variable types, and Perl needs to know whether to sort numerically (where 99 is less than 100) or alphabetically (where 100 comes before 99).
ru_ru: Потому что у нас нет специальных типов переменных и Perl должен знать, нужно ли сортировать численно (где 99 меньше 100) или в алфавитном порядке (100, где идет перед 99).

source: Before Perl 5.10.0 and 5.8.8, PERL5SHELL was not taint checked when running external commands.
ru_ru: До Perl 5.10.0 и 5.8.8, PERL5SHELL было не испортить проверены при выполнении внешних команд.
